AV/FO/INTERSPEC_interfaces_SAP/Exp2Sap/Exp2Sap-example-UpdateCreateInstructions-2-xml.txt

<soap:Envelope xmlns:xsl="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <UpdateOrCreateInstructions xmlns="http://apollovredestein.com/interspec_sap">
      <SequenceNr>243159</SequenceNr>
      <Plant>5M01</Plant>
      <Article>E1CY254518USAX-G</Article>
      <ProcessingGroups>
        <ProcessingGroup>
          <GroupName>APBMI</GroupName>
          <Lines>
            <Line>
              <InstructionType>P</InstructionType>
              <LineNr>10</LineNr>
              <LineText>CAPSTRIP  : 1,5 LAAG, BREEDTE 228 MM.</LineText>
            </Line>
            <Line>
              <InstructionType>P</InstructionType>
              <LineNr>20</LineNr>
              <LineText>            FASE       GRADEN        SPOED VOORSPANNING</LineText>
            </Line>
            <Line>
              <InstructionType>P</InstructionType>
              <LineNr>30</LineNr>
              <LineText>               1          730        -12,5           30</LineText>
            </Line>
            <Line>
              <InstructionType>P</InstructionType>
              <LineNr>40</LineNr>
              <LineText>               2          300          0,1           30</LineText>
            </Line>
            <Line>
              <InstructionType>P</InstructionType>
              <LineNr>50</LineNr>
              <LineText>               3         3110         12,5           30</LineText>
            </Line>
            <Line>
              <InstructionType>P</InstructionType>
              <LineNr>60</LineNr>
              <LineText/>
            </Line>
            <Line>
              <InstructionType>P</InstructionType>
              <LineNr>70</LineNr>
              <LineText>ZIJKANTEN : NA HET OMSLAAN MOETEN DE ZIJKANTEN TEGEN DE SCHOUDERS VAN</LineText>
            </Line>
            <Line>
              <InstructionType>P</InstructionType>
              <LineNr>80</LineNr>
              <LineText>HET</LineText>
            </Line>
            <Line>
              <InstructionType>P</InstructionType>
              <LineNr>90</LineNr>
              <LineText>            LOOPVLAK EINDIGEN.</LineText>
            </Line>
            <Line>
              <InstructionType>P</InstructionType>
              <LineNr>100</LineNr>
              <LineText/>
            </Line>
            <Line>
              <InstructionType>P</InstructionType>
              <LineNr>110</LineNr>
              <LineText>ZIJKANTEN : AFSTAND TUSSEN DE BUITENKANTEN VAN DE ZIJKANTEN  680 MM.</LineText>
            </Line>
            <Line>
              <InstructionType>P</InstructionType>
              <LineNr>120</LineNr>
              <LineText/>
            </Line>
            <Line>
              <InstructionType>S</InstructionType>
              <LineNr>10</LineNr>
              <LineText>RECEPTMENU     :  308 </LineText>
            </Line>
            <Line>
              <InstructionType>S</InstructionType>
              <LineNr>20</LineNr>
              <LineText/>
            </Line>
            <Line>
              <InstructionType>S</InstructionType>
              <LineNr>30</LineNr>
              <LineText>RING / CENTERDEK OPTIES: 45\110, 45\130, 45\150, 45\160</LineText>
            </Line>
            <Line>
              <InstructionType>S</InstructionType>
              <LineNr>40</LineNr>
              <LineText/>
            </Line>
            <Line>
              <InstructionType>S</InstructionType>
              <LineNr>50</LineNr>
              <LineText>HIELAFSTAND    : 428 MM</LineText>
            </Line>
            <Line>
              <InstructionType>S</InstructionType>
              <LineNr>60</LineNr>
              <LineText/>
            </Line>
            <Line>
              <InstructionType>S</InstructionType>
              <LineNr>70</LineNr>
              <LineText>OMTREK WIKKELKLAUWKOP  : 2004 MM   (DIA. 637,9 MM).</LineText>
            </Line>
            <Line>
              <InstructionType>S</InstructionType>
              <LineNr>80</LineNr>
              <LineText>OMTREK GREENTYRE       : 2075 MM   (DIA. 660,5 MM).</LineText>
            </Line>
            <Line>
              <InstructionType>S</InstructionType>
              <LineNr>90</LineNr>
              <LineText/>
            </Line>
            <Line>
              <InstructionType>S</InstructionType>
              <LineNr>100</LineNr>
              <LineText/>
            </Line>
          </Lines>
        </ProcessingGroup>
        <ProcessingGroup>
          <GroupName>APBMJ</GroupName>
          <Lines>
            <Line>
              <InstructionType>P</InstructionType>
              <LineNr>10</LineNr>
              <LineText>CAPSTRIP  : 1,5 LAAG, BREEDTE 228 MM.</LineText>
            </Line>
            <Line>
              <InstructionType>P</InstructionType>
              <LineNr>20</LineNr>
              <LineText>            FASE       GRADEN        SPOED VOORSPANNING</LineText>
            </Line>
            <Line>
              <InstructionType>P</InstructionType>
              <LineNr>30</LineNr>
              <LineText>               1          730        -12,5           30</LineText>
            </Line>
            <Line>
              <InstructionType>P</InstructionType>
              <LineNr>40</LineNr>
              <LineText>               2          300          0,1           30</LineText>
            </Line>
            <Line>
              <InstructionType>P</InstructionType>
              <LineNr>50</LineNr>
              <LineText>               3         3110         12,5           30</LineText>
            </Line>
            <Line>
              <InstructionType>P</InstructionType>
              <LineNr>60</LineNr>
              <LineText/>
            </Line>
            <Line>
              <InstructionType>P</InstructionType>
              <LineNr>70</LineNr>
              <LineText>ZIJKANTEN : NA HET OMSLAAN MOETEN DE ZIJKANTEN TEGEN DE SCHOUDERS VAN</LineText>
            </Line>
            <Line>
              <InstructionType>P</InstructionType>
              <LineNr>80</LineNr>
              <LineText>HET</LineText>
            </Line>
            <Line>
              <InstructionType>P</InstructionType>
              <LineNr>90</LineNr>
              <LineText>            LOOPVLAK EINDIGEN.</LineText>
            </Line>
            <Line>
              <InstructionType>P</InstructionType>
              <LineNr>100</LineNr>
              <LineText/>
            </Line>
            <Line>
              <InstructionType>P</InstructionType>
              <LineNr>110</LineNr>
              <LineText>ZIJKANTEN : AFSTAND TUSSEN DE BUITENKANTEN VAN DE ZIJKANTEN  680 MM.</LineText>
            </Line>
            <Line>
              <InstructionType>P</InstructionType>
              <LineNr>120</LineNr>
              <LineText/>
            </Line>
            <Line>
              <InstructionType>P</InstructionType>
              <LineNr>130</LineNr>
              <LineText/>
            </Line>
            <Line>
              <InstructionType>S</InstructionType>
              <LineNr>10</LineNr>
              <LineText>RECEPTMENU     : 308</LineText>
            </Line>
            <Line>
              <InstructionType>S</InstructionType>
              <LineNr>20</LineNr>
              <LineText/>
            </Line>
            <Line>
              <InstructionType>S</InstructionType>
              <LineNr>30</LineNr>
              <LineText>RING / CENTERDEK OPTIES: 45\110, 45\130, 45\150, 45\160</LineText>
            </Line>
            <Line>
              <InstructionType>S</InstructionType>
              <LineNr>40</LineNr>
              <LineText/>
            </Line>
            <Line>
              <InstructionType>S</InstructionType>
              <LineNr>50</LineNr>
              <LineText>HIELAFSTAND    : 428 MM</LineText>
            </Line>
            <Line>
              <InstructionType>S</InstructionType>
              <LineNr>60</LineNr>
              <LineText/>
            </Line>
            <Line>
              <InstructionType>S</InstructionType>
              <LineNr>70</LineNr>
              <LineText>OMTREK WIKKELKLAUWKOP  : 2004 MM   (DIA. 637,9 MM).</LineText>
            </Line>
            <Line>
              <InstructionType>S</InstructionType>
              <LineNr>80</LineNr>
              <LineText>OMTREK GREENTYRE       : 2075 MM   (DIA. 660,5 MM).</LineText>
            </Line>
            <Line>
              <InstructionType>S</InstructionType>
              <LineNr>90</LineNr>
              <LineText/>
            </Line>
            <Line>
              <InstructionType>S</InstructionType>
              <LineNr>100</LineNr>
              <LineText/>
            </Line>
          </Lines>
        </ProcessingGroup>
      </ProcessingGroups>
    </UpdateOrCreateInstructions>
  </soap:Body>
</soap:Envelope>